NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_friend.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <unity.h>
#include "mesh_friend.h"
#include "friend_internal.h"
#include "nrf_error.h"
#include "transport_internal.h"
#include "mesh_config_entry_mock.h"
#include "transport_mock.h"
#include "core_tx_friend_mock.h"
#include "nrf_mesh_externs_mock.h"
#include "event_mock.h"
#include "timer_scheduler_mock.h"
#include "friend_sublist_mock.h"
#include "net_state_mock.h"
#include "network_mock.h"
#include "nrf_mesh_events_mock.h"
#include "manual_mock_queue.h"
#include "test_helper.h"
#include "test_assert.h"
#include "device_state_manager_mock.h"

#include "mesh_opt_friend.h"
#include "log.h"

#define FRIEND_SRC 0x0010
#define FRIEND_SRC2 0x0011
#define LPN_SRC     0x00A0
#define LPN_SRC2    0x00A2
#define LPN_SRC3    0x00A3
#define LPN_SRC4    0x00A4
#define LPN_SRC5    0x00A5
#define LPN_ELEMENT_COUNT 3
#define DEFAULT_TTL 125
#define FRIEND_OPCODE_HANDLER_COUNT 6
#define TIME_NOW 1234
#define RECEIVE_DELAY_MS 80
#define POLL_TIMEOUT_MS 3000
#define RSSI_FACTOR MESH_FRIENDSHIP_RSSI_FACTOR_1_0
#define RECEIVE_WINDOW_FACTOR MESH_FRIENDSHIP_RECEIVE_WINDOW_FACTOR_2_0
#define MIN_FRIEND_QUEUE_SIZE MESH_FRIENDSHIP_MIN_FRIEND_QUEUE_SIZE_8

#define FRIEND_RECENT_LPNS_LIST_COUNT (MESH_FRIEND_FRIENDSHIP_COUNT + 1)

/******************************************************************************
 * Static variables
 ******************************************************************************/

static const transport_control_packet_handler_t * mp_trs_opcode_handlers = NULL;
static transport_control_packet_t m_expected_ctrl_pdu;
static nrf_mesh_network_secmat_t m_default_secmat;
static nrf_mesh_network_secmat_t m_friend_secmat;
static uint16_t m_friend_counter;
static uint16_t m_lpn_src = LPN_SRC;
static uint32_t m_time_now;
static timer_event_t * mp_confirm_send_timer;
static nrf_mesh_rx_metadata_t m_rx_metadata;
static network_tx_packet_buffer_t m_net_buf;
static uint8_t m_trs_pdu[PACKET_MESH_TRS_UNSEG_ACCESS_MAX_SIZE];
static packet_mesh_trs_packet_t m_expected_trs_pdu;
static mesh_friendship_t m_friendship;

static nrf_mesh_evt_handler_cb_t frnd_event_hndlr;

MOCK_QUEUE_DEF(event_queue, nrf_mesh_evt_t, NULL);
/******************************************************************************
 * Extern Variables
 ******************************************************************************/
extern const mesh_config_entry_params_t m_mesh_opt_friend_params;

/*******************************************************************************
 * Mock Functions
 ******************************************************************************/
uint32_t mesh_config_entry_set_mock(mesh_config_entry_id_t entry_id, const void * p_data, int calls)
{
    UNUSED_PARAMETER(calls);
    return m_mesh_opt_friend_params.callbacks.setter(entry_id, p_data);
}

uint32_t mesh_config_entry_get_mock(mesh_config_entry_id_t entry_id, void * p_entry, int calls)
{
    UNUSED_PARAMETER(calls);
    m_mesh_opt_friend_params.callbacks.getter(entry_id, p_entry);
    return NRF_SUCCESS;
}

uint32_t mesh_config_entry_delete_mock(mesh_config_entry_id_t entry_id, int calls)
{
    UNUSED_PARAMETER(calls);
    m_mesh_opt_friend_params.callbacks.deleter(entry_id);
    return NRF_SUCCESS;
}


static uint32_t transport_control_packet_consumer_add_stub(
    const transport_control_packet_handler_t * p_handlers,
    uint32_t handler_count,
    int num_calls)
{
    TEST_ASSERT_EQUAL(FRIEND_OPCODE_HANDLER_COUNT, handler_count);
    mp_trs_opcode_handlers = p_handlers;
    /* transport_control_packet_consumer_add_StubWithCallback(NULL); */
    return NRF_SUCCESS;
}

static uint32_t transport_control_tx_stub(const transport_control_packet_t * p_params,
                                          nrf_mesh_tx_token_t tx_token,
                                          int num_calls)
{
    const transport_control_packet_t * p_expected = &m_expected_ctrl_pdu;

    TEST_ASSERT_EQUAL(p_expected->data_len, p_params->data_len);
    TEST_ASSERT_EQUAL(p_expected->opcode, p_params->opcode);
    TEST_ASSERT_EQUAL_MEMORY(p_expected->p_data,
                             p_params->p_data,
                             p_params->data_len);
    TEST_ASSERT_EQUAL_PTR(p_expected->p_net_secmat, p_params->p_net_secmat);
    TEST_ASSERT_EQUAL(p_expected->dst.value, p_params->dst.value);
    TEST_ASSERT_EQUAL_HEX(p_expected->bearer_selector, p_params->bearer_selector);
    transport_control_tx_StubWithCallback(NULL);
    memset(&m_expected_ctrl_pdu, 0, sizeof(m_expected_ctrl_pdu));
    return NRF_SUCCESS;
}

static void event_handle_stub(const nrf_mesh_evt_t * p_evt,
                              int num_calls)
{
    nrf_mesh_evt_t expected;
    event_queue_Consume(&expected);
    TEST_ASSERT_EQUAL_nrf_mesh_evt_t(expected, (*p_evt));
}

static void unicast_address_get_Expect(void)
{
    static uint16_t local_address = FRIEND_SRC;
    static uint16_t local_address_count = 2;
    nrf_mesh_unicast_address_get_Expect(NULL, NULL);
    nrf_mesh_unicast_address_get_IgnoreArg_p_addr_start();
    nrf_mesh_unicast_address_get_IgnoreArg_p_addr_count();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&local_address);
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_count(&local_address_count);
}

static void friendship_secmat_get_Expect(void)
{
    /* Must be static to not have the compiler be "clever". */
    static const nrf_mesh_network_secmat_t * p_net_secmat = &m_friend_secmat;
    nrf_mesh_friendship_secmat_get_Expect(m_lpn_src, NULL);
    nrf_mesh_friendship_secmat_get_IgnoreArg_pp_secmat();
    nrf_mesh_friendship_secmat_get_ReturnThruPtr_pp_secmat(&p_net_secmat);
}

