NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_friend.c
static void transport_control_tx_Expect(transport_control_opcode_t opcode,
                                        const packet_mesh_trs_control_packet_t * p_data,
                                        uint32_t length,
                                        uint16_t dst,
                                        core_tx_bearer_type_t bearer_selector,
                                        const nrf_mesh_network_secmat_t * p_net_secmat)
{
    if (opcode != TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR_CONFIRM)
    {
        unicast_address_get_Expect();
    }
    m_expected_ctrl_pdu.opcode = opcode;
    m_expected_ctrl_pdu.p_data =  p_data;
    m_expected_ctrl_pdu.data_len = length;
    m_expected_ctrl_pdu.src = FRIEND_SRC;
    m_expected_ctrl_pdu.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    m_expected_ctrl_pdu.dst.value = dst;
    m_expected_ctrl_pdu.dst.p_virtual_uuid = NULL;
    m_expected_ctrl_pdu.p_net_secmat = p_net_secmat;
    m_expected_ctrl_pdu.ttl = DEFAULT_TTL;
    m_expected_ctrl_pdu.bearer_selector = bearer_selector;
    transport_control_tx_StubWithCallback(transport_control_tx_stub);
}

static void friendship_established_event_Expect(void)
{
    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED;
    evt.params.friendship_established.role = NRF_MESH_FRIENDSHIP_ROLE_FRIEND;
    evt.params.friendship_established.lpn_src = m_lpn_src;
    evt.params.friendship_established.friend_src = FRIEND_SRC;
    event_queue_Expect(&evt);
}

timestamp_t timer_now(void)
{
    return m_time_now;
}

static void timer_sch_reschedule_stub(timer_event_t* p_timer_evt, timestamp_t new_timestamp, int num)
{
    TEST_ASSERT(p_timer_evt != NULL);
    TEST_ASSERT(p_timer_evt->cb != NULL);

    mp_confirm_send_timer = p_timer_evt;
    mp_confirm_send_timer->timestamp = new_timestamp;
}

static void timer_trigger(timer_event_t * p_timer)
{
    timer_sch_abort_Expect(p_timer);
    p_timer->cb(timer_now(), p_timer->p_context);
}

static void friend_rx(transport_control_opcode_t opcode,
                      const packet_mesh_trs_control_packet_t * p_pdu,
                      uint32_t length,
                      uint16_t src,
                      uint16_t dst,
                      const nrf_mesh_rx_metadata_t * p_metadata)
{
    transport_control_packet_t ctrl_packet = {0};

    ctrl_packet.opcode = opcode;
    ctrl_packet.p_data = p_pdu;
    ctrl_packet.data_len = length;
    ctrl_packet.src = src;
    ctrl_packet.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    ctrl_packet.dst.value = dst;
    ctrl_packet.p_net_secmat = &m_default_secmat;


    for (uint32_t i = 0; i < FRIEND_OPCODE_HANDLER_COUNT; ++i)
    {
        if (mp_trs_opcode_handlers[i].opcode == opcode)
        {
            mp_trs_opcode_handlers[i].callback(&ctrl_packet, p_metadata);
            return;
        }
    }

    char buf[64];
    (void) sprintf(buf, "Did not find handler for opcode %x.", opcode);
    TEST_FAIL_MESSAGE(buf);
}

static void friend_poll_Receive(uint8_t fsn)
{
    static packet_mesh_trs_control_packet_t friend_poll;
    packet_mesh_trs_control_friend_poll_fsn_set(&friend_poll, fsn);
    friend_rx(TRANSPORT_CONTROL_OPCODE_FRIEND_POLL,
              &friend_poll,
              PACKET_MESH_TRS_CONTROL_FRIEND_POLL_SIZE,
              m_lpn_src,
              FRIEND_SRC,
              &m_rx_metadata);
}

static void friend_clear_Receive(uint16_t lpn_addr, uint16_t lpn_counter_new_friend)
{
    static packet_mesh_trs_control_packet_t friend_clear;
    packet_mesh_trs_control_friend_clear_lpn_address_set(&friend_clear, lpn_addr);
    packet_mesh_trs_control_friend_clear_lpn_counter_set(&friend_clear, lpn_counter_new_friend);

    friend_rx(TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR,
              &friend_clear,
              PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE,
              FRIEND_SRC2,
              FRIEND_SRC,
              &m_rx_metadata);
}

static void friend_friendships_Verify(void)
{
    const mesh_friendship_t * p_friendships[MESH_FRIEND_FRIENDSHIP_COUNT];
    uint8_t count = MESH_FRIEND_FRIENDSHIP_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_friend_friendships_get(&p_friendships[0], &count));
    TEST_ASSERT_EQUAL_UINT8(1, count);
    TEST_ASSERT_EQUAL_MEMORY(&m_friendship, p_friendships[0], sizeof(mesh_friendship_t));
}

static void friend_request_Receive(uint16_t prev_address, uint16_t dst)
{
    static packet_mesh_trs_control_packet_t friend_request;
    packet_mesh_trs_control_friend_request_rssi_factor_set(
        &friend_request, RSSI_FACTOR);
    packet_mesh_trs_control_friend_request_receive_window_factor_set(
        &friend_request, RECEIVE_WINDOW_FACTOR);
    packet_mesh_trs_control_friend_request_min_queue_size_log_set(
        &friend_request, MIN_FRIEND_QUEUE_SIZE);
    packet_mesh_trs_control_friend_request_receive_delay_set(
        &friend_request, RECEIVE_DELAY_MS);
    packet_mesh_trs_control_friend_request_poll_timeout_set(
        &friend_request, POLL_TIMEOUT_MS / 100);
    packet_mesh_trs_control_friend_request_previous_address_set(
        &friend_request, prev_address);
    packet_mesh_trs_control_friend_request_num_elements_set(
        &friend_request, LPN_ELEMENT_COUNT);
    packet_mesh_trs_control_friend_request_lpn_counter_set(
        &friend_request, 0);

    friend_rx(TRANSPORT_CONTROL_OPCODE_FRIEND_REQUEST,
              &friend_request,
              PACKET_MESH_TRS_CONTROL_FRIEND_REQUEST_SIZE,
              m_lpn_src,
              dst,
              &m_rx_metadata);
}

static void poll_timeout_schedule_Expect(uint32_t timeout_us)
{
    timer_sch_reschedule_Expect(NULL, timeout_us);
    timer_sch_reschedule_IgnoreArg_p_timer_evt();
}

static uint32_t network_packet_alloc_stub(network_tx_packet_buffer_t * p_buf,
                                          int num_calls)
{
    TEST_ASSERT_EQUAL_network_tx_packet_buffer_t(m_net_buf, (*p_buf));
    p_buf->p_payload = m_net_buf.p_payload;
    network_packet_alloc_StubWithCallback(NULL);
    return NRF_SUCCESS;
}

static void network_packet_send_stub(const network_tx_packet_buffer_t * p_buffer,
                                     int num_calls)
{
    TEST_ASSERT_EQUAL_MEMORY(&m_expected_trs_pdu, p_buffer->p_payload, p_buffer->user_data.payload_len);
    memset(&m_net_buf, 0, sizeof(m_net_buf));
    network_packet_send_StubWithCallback(NULL);
}

