NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_friend.c
static void friend_relay_Expect(const packet_mesh_trs_packet_t * p_packet,
                                uint8_t length,
                                const transport_packet_metadata_t * p_metadata)
{
    friendship_secmat_get_Expect();
    m_net_buf.user_data.token = 0; /* TODO: Fix tokens */
    m_net_buf.user_data.payload_len = length;
    m_net_buf.user_data.bearer_selector = CORE_TX_BEARER_TYPE_FRIEND;
    m_net_buf.user_data.role = p_metadata->net.control_packet ? CORE_TX_ROLE_ORIGINATOR : CORE_TX_ROLE_RELAY;
    m_net_buf.p_payload = m_trs_pdu;

    memcpy(&m_expected_trs_pdu, p_packet, length);
    network_packet_alloc_StubWithCallback(network_packet_alloc_stub);
    network_packet_send_StubWithCallback(network_packet_send_stub);

    core_tx_friend_schedule_Expect(NULL,
                                   m_rx_metadata.params.scanner.timestamp +
                                   MS_TO_US(RECEIVE_DELAY_MS));
    core_tx_friend_schedule_IgnoreArg_p_bearer();
    poll_timeout_schedule_Expect(m_rx_metadata.params.scanner.timestamp +
                                 MS_TO_US(POLL_TIMEOUT_MS));
}

static void friend_update_Expect(nrf_mesh_key_refresh_phase_t phase)
{
    static packet_mesh_trs_control_packet_t friend_update;
    memset(&friend_update, 0, sizeof(friend_update));
    packet_mesh_trs_control_friend_update_key_refresh_flag_set(
        &friend_update, 0);
    packet_mesh_trs_control_friend_update_iv_update_flag_set(
        &friend_update, 0);
    packet_mesh_trs_control_friend_update_iv_index_set(
        &friend_update, 0x1234);
    packet_mesh_trs_control_friend_update_md_set(
        &friend_update, 0);

    net_state_iv_update_get_ExpectAndReturn(NET_STATE_IV_UPDATE_NORMAL);
    nrf_mesh_key_refresh_phase_get_ExpectAndReturn(NULL, phase);
    nrf_mesh_key_refresh_phase_get_IgnoreArg_p_secmat();
    net_state_beacon_iv_index_get_ExpectAndReturn(0x1234);

    friendship_secmat_get_Expect();
    transport_control_tx_Expect(TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE,
                                &friend_update,
                                PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE,
                                m_lpn_src,
                                CORE_TX_BEARER_TYPE_FRIEND,
                                &m_friend_secmat);

    core_tx_friend_schedule_Expect(NULL,
                                   m_rx_metadata.params.scanner.timestamp +
                                   MS_TO_US(RECEIVE_DELAY_MS));
    core_tx_friend_schedule_IgnoreArg_p_bearer();
    poll_timeout_schedule_Expect(m_rx_metadata.params.scanner.timestamp +
                                 MS_TO_US(POLL_TIMEOUT_MS));
}


static void friend_clear_confirm_Expect(uint16_t lpn_addr, uint16_t lpn_counter)
{
    static packet_mesh_trs_control_packet_t friend_clear_confirm;

    memset(&friend_clear_confirm, 0, sizeof(friend_clear_confirm));
    packet_mesh_trs_control_friend_clear_confirm_lpn_address_set(&friend_clear_confirm, lpn_addr);
    packet_mesh_trs_control_friend_clear_confirm_lpn_counter_set(&friend_clear_confirm, lpn_counter);

    transport_control_tx_Expect(TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR_CONFIRM,
                                &friend_clear_confirm,
                                PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_CONFIRM_SIZE,
                                FRIEND_SRC2,
                                CORE_TX_BEARER_TYPE_ALLOW_ALL,
                                &m_default_secmat);
}

static void friend_update_enqueue_Expect(void)
{
    static packet_mesh_trs_control_packet_t friend_update;
    memset(&friend_update, 0, sizeof(friend_update));
    packet_mesh_trs_control_friend_update_key_refresh_flag_set(
        &friend_update, 0);
    packet_mesh_trs_control_friend_update_iv_update_flag_set(
        &friend_update, 0);
    packet_mesh_trs_control_friend_update_iv_index_set(
        &friend_update, 0x1234);
    packet_mesh_trs_control_friend_update_md_set(
        &friend_update, 0);

    unicast_address_get_Expect();
    friendship_secmat_get_Expect();

    net_state_iv_update_get_ExpectAndReturn(NET_STATE_IV_UPDATE_NORMAL);
    nrf_mesh_key_refresh_phase_get_ExpectAndReturn(NULL, NRF_MESH_KEY_REFRESH_PHASE_2);
    nrf_mesh_key_refresh_phase_get_IgnoreArg_p_secmat();
    net_state_beacon_iv_index_get_ExpectAndReturn(0x1234);
}

static void friend_offer_Expect(void)
{
    static packet_mesh_trs_control_packet_t friend_offer;
    packet_mesh_trs_control_friend_offer_receive_window_set(
        &friend_offer, MESH_FRIEND_RECEIVE_WINDOW_DEFAULT_MS);
    packet_mesh_trs_control_friend_offer_queue_size_set(
        &friend_offer, MESH_FRIEND_QUEUE_SIZE);
    packet_mesh_trs_control_friend_offer_subscription_list_size_set(
        &friend_offer, MESH_FRIEND_SUBLIST_SIZE);
    packet_mesh_trs_control_friend_offer_rssi_set(
        &friend_offer, m_rx_metadata.params.scanner.rssi);
    packet_mesh_trs_control_friend_offer_friend_counter_set(
        &friend_offer, m_friend_counter);
    m_friend_counter++;
    core_tx_friend_enable_ExpectAnyArgs();
    transport_control_tx_Expect(TRANSPORT_CONTROL_OPCODE_FRIEND_OFFER,
                                &friend_offer,
                                PACKET_MESH_TRS_CONTROL_FRIEND_OFFER_SIZE,
                                m_lpn_src,
                                CORE_TX_BEARER_TYPE_FRIEND,
                                &m_default_secmat);

    timestamp_t offer_delay = m_rx_metadata.params.scanner.timestamp
        + MS_TO_US(MAX(((RECEIVE_WINDOW_FACTOR * 0.5 + 1) * MESH_FRIEND_RECEIVE_WINDOW_DEFAULT_MS -
                       (RSSI_FACTOR * 0.5 + 1) * m_rx_metadata.params.scanner.rssi),
                       100));
    core_tx_friend_schedule_Expect(NULL, offer_delay);
    core_tx_friend_schedule_IgnoreArg_p_bearer();


    m_friendship.lpn.src = m_lpn_src;
    m_friendship.lpn.prev_friend_src = 0;
    m_friendship.lpn.element_count = LPN_ELEMENT_COUNT;
    m_friendship.lpn.request_count = 0;
    m_friendship.poll_timeout_ms = POLL_TIMEOUT_MS;
    m_friendship.poll_count = 0;
    m_friendship.receive_delay_ms = RECEIVE_DELAY_MS;
    m_friendship.receive_window_ms = MESH_FRIEND_RECEIVE_WINDOW_DEFAULT_MS;
    m_friendship.avg_rssi = m_rx_metadata.params.scanner.rssi;

    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_FRIEND_REQUEST;
    evt.params.friend_request.p_friendship = &m_friendship;
    evt.params.friend_request.p_net = &m_default_secmat;
    evt.params.friend_request.p_metadata = &m_rx_metadata;
    event_queue_Expect(&evt);
    poll_timeout_schedule_Expect(offer_delay + SEC_TO_US(1));
}

