NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_friend.c
static void friendship_state_reset_Expect(void)
{
    core_tx_friend_disable_ExpectAnyArgs();
    friend_sublist_clear_ExpectAnyArgs();
    timer_sch_abort_ExpectAnyArgs();
}

static void friendship_terminated_event_Expect(void)
{
    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
    evt.params.friendship_terminated.role = NRF_MESH_FRIENDSHIP_ROLE_FRIEND;
    evt.params.friendship_terminated.lpn_src = m_lpn_src;
    evt.params.friendship_terminated.friend_src = FRIEND_SRC;
    evt.params.friendship_terminated.reason = NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_USER;
    event_queue_Expect(&evt);
}

static void friendship_terminated_event_Expect_reason6(void)
{
    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
    evt.params.friendship_terminated.role = NRF_MESH_FRIENDSHIP_ROLE_FRIEND;
    evt.params.friendship_terminated.lpn_src = m_lpn_src;
    evt.params.friendship_terminated.friend_src = FRIEND_SRC;
    evt.params.friendship_terminated.reason = NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_NEW_FRIEND;
    event_queue_Expect(&evt);
}

static void friendship_Terminate(void)
{
    unicast_address_get_Expect();
    friendship_state_reset_Expect();
    friendship_terminated_event_Expect();
    const mesh_friendship_t * p_friendships[MESH_FRIEND_FRIENDSHIP_COUNT];
    uint8_t count = MESH_FRIEND_FRIENDSHIP_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_friend_friendships_get(&p_friendships[0], &count));
    timer_sch_reschedule_StubWithCallback(timer_sch_reschedule_stub);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_friend_friendship_terminate(p_friendships[0]));
}

static void friendship_Terminate_by_friend_clear(void)
{
    unicast_address_get_Expect();
    friendship_state_reset_Expect();
    friendship_terminated_event_Expect_reason6();
    const mesh_friendship_t * p_friendships[MESH_FRIEND_FRIENDSHIP_COUNT];
    uint8_t count = MESH_FRIEND_FRIENDSHIP_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_friend_friendships_get(&p_friendships[0], &count));
    timer_sch_reschedule_StubWithCallback(timer_sch_reschedule_stub);
    friend_clear_confirm_Expect(p_friendships[0]->lpn.src, p_friendships[0]->lpn.request_count);

    friend_clear_Receive(p_friendships[0]->lpn.src, p_friendships[0]->lpn.request_count);
}

void nrf_mesh_evt_handler_add_cb(nrf_mesh_evt_handler_t * p_handler_params, int num_calls)
{
    UNUSED_PARAMETER(num_calls);
    TEST_ASSERT_NOT_NULL(p_handler_params);
    frnd_event_hndlr = p_handler_params->evt_cb;
    TEST_ASSERT_NOT_NULL(frnd_event_hndlr);
}

/*******************************************************************************
 * Test Setup
 ******************************************************************************/
void setUp(void)
{
    mesh_config_entry_mock_Init();
    transport_mock_Init();
    core_tx_friend_mock_Init();
    nrf_mesh_externs_mock_Init();
    event_mock_Init();
    timer_scheduler_mock_Init();
    friend_sublist_mock_Init();
    net_state_mock_Init();
    network_mock_Init();
    event_queue_Init();
    nrf_mesh_events_mock_Init();
    device_state_manager_mock_Init();

    __LOG_INIT(0xFFFFFFFF, LOG_LEVEL_DBG3, LOG_CALLBACK_DEFAULT);

    m_rx_metadata.params.scanner.rssi = -8;
    m_rx_metadata.params.scanner.timestamp = TIME_NOW;
    m_friend_counter = 0;
    m_lpn_src = LPN_SRC;
    m_time_now = TIME_NOW;
    memset(&m_net_buf, 0, sizeof(m_net_buf));
    memset(m_trs_pdu, 0, sizeof(m_trs_pdu));
    memset(&m_expected_trs_pdu, 0, sizeof(m_expected_trs_pdu));
    memset(&m_expected_ctrl_pdu, 0, sizeof(m_expected_ctrl_pdu));
    event_handle_StubWithCallback(event_handle_stub);
    mesh_config_entry_set_StubWithCallback(mesh_config_entry_set_mock);
    mesh_config_entry_get_StubWithCallback(mesh_config_entry_get_mock);
    mesh_config_entry_delete_StubWithCallback(mesh_config_entry_delete_mock);
    nrf_mesh_evt_handler_add_StubWithCallback(nrf_mesh_evt_handler_add_cb);

    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        friend_sublist_init_ExpectAnyArgs();
        core_tx_friend_init_ExpectAnyArgs();
    }

    transport_control_packet_consumer_add_StubWithCallback(
        transport_control_packet_consumer_add_stub);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_friend_init());
    TEST_ASSERT_NOT_NULL_MESSAGE(mp_trs_opcode_handlers,
                                 "Opcode handlers not set.");
}

static bool buffer_is_zeroed(void * buf, size_t size)
{
    unsigned char * p_char_buf = buf;
    return ((p_char_buf[0] == 0) &&
            (memcmp(p_char_buf, p_char_buf + 1, size -1) == 0));

}

void tearDown(void)
{
    TEST_ASSERT_MESSAGE(buffer_is_zeroed(&m_expected_ctrl_pdu, sizeof(m_expected_ctrl_pdu)),
                        "Expected ctrl PDU to be cleared. Perhaps the PDU was not sent?");

    TEST_ASSERT_NULL_MESSAGE(m_net_buf.p_payload, "network_packet_send() call less times than expected");

    mesh_config_entry_mock_Verify();
    mesh_config_entry_mock_Destroy();
    transport_mock_Verify();
    transport_mock_Destroy();
    core_tx_friend_mock_Verify();
    core_tx_friend_mock_Destroy();
    nrf_mesh_externs_mock_Verify();
    nrf_mesh_externs_mock_Destroy();
    event_mock_Verify();
    event_mock_Destroy();
    event_queue_Verify();
    event_queue_Destroy();
    timer_scheduler_mock_Verify();
    timer_scheduler_mock_Destroy();
    friend_sublist_mock_Verify();
    friend_sublist_mock_Destroy();
    net_state_mock_Verify();
    net_state_mock_Destroy();
    network_mock_Verify();
    network_mock_Destroy();
    nrf_mesh_events_mock_Verify();
    nrf_mesh_events_mock_Destroy();
    device_state_manager_mock_Verify();
    device_state_manager_mock_Destroy();
}

/*******************************************************************************
 * Test functions
 ******************************************************************************/

void test_enable(void)
{
    bool enabled;

    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_get(&enabled));
    TEST_ASSERT_FALSE(enabled);

