NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_friend.c
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_set(true));
    /* Second attempt returns NRF_SUCCESS */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_set(true));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_get(&enabled));
    TEST_ASSERT_TRUE(enabled);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_set(false));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_set(false));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_get(&enabled));
    TEST_ASSERT_FALSE(enabled);

    mesh_friend_enable();
    /* Second attempt (to check correct double invoking) */
    mesh_friend_enable();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_get(&enabled));
    TEST_ASSERT_TRUE(enabled);

    mesh_friend_disable();
    /* Second attempt (to check correct double invoking) */
    mesh_friend_disable();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_get(&enabled));
    TEST_ASSERT_FALSE(enabled);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_set(true));
    m_mesh_opt_friend_params.callbacks.deleter(MESH_OPT_FRIEND_EID);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, mesh_opt_friend_get(&enabled));
    TEST_ASSERT_FALSE(enabled);
}

void test_config_errors(void)
{
    mesh_config_entry_set_StubWithCallback(NULL);
    mesh_config_entry_get_StubWithCallback(NULL);

    mesh_config_entry_set_ExpectAnyArgsAndReturn(NRF_ERROR_NOT_FOUND);
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, mesh_opt_friend_set(true));

    mesh_config_entry_get_ExpectAnyArgsAndReturn(NRF_ERROR_NULL);
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, mesh_opt_friend_get(NULL));
}

void test_friend_offer(void)
{
    mesh_friend_enable();
    unicast_address_get_Expect();
    nrf_mesh_friendship_secmat_params_set_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    friend_offer_Expect();
    friend_request_Receive(NRF_MESH_ADDR_UNASSIGNED, NRF_MESH_ALL_FRIENDS_ADDR);
}

void test_no_offer_when_all_friends_are_taken(void)
{
    mesh_friend_enable();
    /* Should all succeed. */
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        test_friend_offer();
        m_lpn_src++;
    }

    /* Next firend request should not get a reply. There are no more friends :( */
    friend_request_Receive(NRF_MESH_ADDR_UNASSIGNED, NRF_MESH_ALL_FRIENDS_ADDR);
}

void test_no_offer_with_invalid_dst(void)
{
    mesh_friend_enable();
    friend_request_Receive(NRF_MESH_ADDR_UNASSIGNED, FRIEND_SRC);
}

void test_lower_bound_of_friend_offer_delay_is_100ms(void)
{
    TEST_IGNORE_MESSAGE("Not implemented test.");
}

static void friendship_Establish(void)
{
    test_friend_offer();
    friend_update_Expect(NRF_MESH_KEY_REFRESH_PHASE_0);
    unicast_address_get_Expect();
    friendship_established_event_Expect();
    friend_poll_Receive(0);
    friend_friendships_Verify();
}

void test_friend_relay(void)
{
    mesh_friend_enable();
    const packet_mesh_trs_packet_t trs_pdu = {.pdu = {
            (1 << 6) | 0x0C,         /* AKF | AID */
            0xde, 0xad, 0xbe, 0xef,  /* Payload */
            0xde, 0xad, 0xca, 0xfe   /* Transport MIC */
        }};
    const uint8_t trs_pdu_length = 9;
    const transport_packet_metadata_t trs_metadata = {
        .segmented = false,
        .receivers = TRANSPORT_PACKET_RECEIVER_FRIEND,
        .mic_size = 4,
        .type.access = {
            .using_app_key = true,
            .app_key_id = 0x0c
        },
        .segmentation = {0},
        .net = {
            .control_packet = false,
            .src = 0x00AA,
            .dst = {.value = m_lpn_src + LPN_ELEMENT_COUNT - 1, .type = NRF_MESH_ADDRESS_TYPE_UNICAST}
        },
        .p_security_material = NULL,
        .token = 0xDEAD1337,
        .tx_bearer_selector = CORE_TX_BEARER_TYPE_FRIEND
    };

    friendship_Establish();
    friend_packet_in(&trs_pdu, trs_pdu_length, &trs_metadata, CORE_TX_ROLE_RELAY);
    friend_relay_Expect(&trs_pdu, trs_pdu_length, &trs_metadata);
    friend_poll_Receive(1);

    /* We should get the same PDU again when FSN is the same. */
    friend_relay_Expect(&trs_pdu, trs_pdu_length, &trs_metadata);
    friend_poll_Receive(1);

    /* Now there are no more data, we should get a Friend Update. */
    friend_update_Expect(NRF_MESH_KEY_REFRESH_PHASE_0);
    friend_poll_Receive(0);

    friendship_Terminate();
}

void test_friend_needs_packet(void)
{
    TEST_NRF_MESH_ASSERT_EXPECT(friend_needs_packet(NULL));

    transport_packet_metadata_t trs_metadata = {
        .segmented = false,
        .receivers = TRANSPORT_PACKET_RECEIVER_FRIEND,
        .mic_size = 4,
        .type.access = {
            .using_app_key = true,
            .app_key_id = 0x0c
        },
        .segmentation = {0},
        .net = {
            .control_packet = false,
            .src = 0x00AA,
            .dst = {
                .value = m_lpn_src,
                .type = NRF_MESH_ADDRESS_TYPE_UNICAST
            },
            .ttl = 3,
        },
        .p_security_material = NULL,
        .token = 0xDEAD1337,
        .tx_bearer_selector = CORE_TX_BEARER_TYPE_FRIEND
    };

    /* Friend feature disabled. */
    TEST_ASSERT_FALSE(friend_needs_packet(&trs_metadata));

    /* Enabling friend feature. */
    mesh_friend_enable();
    friendship_Establish();
    TEST_ASSERT_TRUE(friend_needs_packet(&trs_metadata));

    /* No relaying for TTL < 2 (Mesh profile v1.0,  sec. 3.5.5). */
    trs_metadata.net.ttl = 1;
    TEST_ASSERT_FALSE(friend_needs_packet(&trs_metadata));
    trs_metadata.net.ttl = 3;

    /* Friend queue is less than number of segments. */
    trs_metadata.segmented = true;
    trs_metadata.segmentation.last_segment = MESH_FRIEND_QUEUE_SIZE;
    TEST_ASSERT_FALSE(friend_needs_packet(&trs_metadata));
    trs_metadata.segmented = false;

    /* Unknown unicast address. */
    trs_metadata.net.dst.value = m_lpn_src + LPN_ELEMENT_COUNT;
    TEST_ASSERT_FALSE(friend_needs_packet(&trs_metadata));
    trs_metadata.net.dst.value = m_lpn_src;

    /* LPN does not have a group address in subscription. */
    trs_metadata.net.dst.type = NRF_MESH_ADDRESS_TYPE_GROUP;
    trs_metadata.net.dst.value = 0xC001;
    friend_sublist_contains_ExpectAndReturn(NULL, trs_metadata.net.dst.value, NRF_ERROR_NOT_FOUND);
    friend_sublist_contains_IgnoreArg_p_sublist();
    TEST_ASSERT_FALSE(friend_needs_packet(&trs_metadata));

    friend_sublist_contains_ExpectAndReturn(NULL, trs_metadata.net.dst.value, NRF_SUCCESS);
    friend_sublist_contains_IgnoreArg_p_sublist();
    TEST_ASSERT_TRUE(friend_needs_packet(&trs_metadata));
}

void test_confirm_send_timer(void)
{
    mesh_friend_enable();

    /* Case 1: Friendship is established and terminated with Friend Clear.
       Check that the response to friend clear is received afterwards. */
    nrf_mesh_externs_mock_Verify();

