NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_friend.c
    friendship_Establish();
    friendship_Terminate_by_friend_clear();

    nrf_mesh_externs_mock_Verify();

    // Receive a new friend clear, and expect confirm
    friend_clear_confirm_Expect(LPN_SRC, 0);
    friend_clear_Receive(LPN_SRC, 0);

    // Expire the timer, and receive a new friend clear, don't expect confirm
    timer_trigger(mp_confirm_send_timer);
    friend_clear_Receive(LPN_SRC, 1);

    /* Case 2: Friendship is established and terminated.
      Check that the response to friend clear is received afterwards. */
    friendship_Establish();
    friendship_Terminate();

    // Receive a new friend clear, and expect confirm
    friend_clear_confirm_Expect(LPN_SRC, 0);
    friend_clear_Receive(LPN_SRC, 0);

    // Receive a new out of range friend clear, and don't expect confirm
    friend_clear_Receive(LPN_SRC, 257);

    // Expire the timer, and receive a new friend clear, don't expect confirm
    timer_trigger(mp_confirm_send_timer);
    friend_clear_Receive(LPN_SRC, 1);

    /* Case 3: Friendship is established with many LPNs */
    uint32_t i;

    /* Last termination should over-write the first entry (corresponding to LPN_SRC) */
    for (i = 0; i < (FRIEND_RECENT_LPNS_LIST_COUNT + 1); i++)
    {
        friendship_Establish();
        friendship_Terminate();

        m_time_now++;
        m_lpn_src++;
    }

    m_lpn_src = LPN_SRC;
    for (i = 0; i < (FRIEND_RECENT_LPNS_LIST_COUNT + 1); i++)
    {
        if (m_lpn_src == LPN_SRC)
        {
            friend_clear_Receive(LPN_SRC, 1);
        }
        else
        {
            friend_clear_confirm_Expect(LPN_SRC2, 0);
            friend_clear_Receive(LPN_SRC2, 0);
        }

        m_lpn_src++;
    }
}

void test_key_refresh_queueing(void)
{
    nrf_mesh_evt_t evt =
    {
        .type = NRF_MESH_EVT_KEY_REFRESH_NOTIFICATION,
    };

    /* Enabling friend feature. */
    mesh_friend_enable();
    friendship_Establish();

    evt.params.key_refresh.phase = NRF_MESH_KEY_REFRESH_PHASE_0;
    nrf_mesh_net_secmat_from_index_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    friendship_secmat_get_Expect();
    nrf_mesh_net_master_secmat_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    frnd_event_hndlr(&evt);
    friend_update_Expect(NRF_MESH_KEY_REFRESH_PHASE_0);
    friend_poll_Receive(1);

    evt.params.key_refresh.phase = NRF_MESH_KEY_REFRESH_PHASE_1;
    nrf_mesh_net_secmat_from_index_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    friendship_secmat_get_Expect();
    nrf_mesh_net_master_secmat_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    frnd_event_hndlr(&evt);
    friend_update_Expect(NRF_MESH_KEY_REFRESH_PHASE_1);
    friend_poll_Receive(0);

    evt.params.key_refresh.phase = NRF_MESH_KEY_REFRESH_PHASE_2;
    nrf_mesh_net_secmat_from_index_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    friendship_secmat_get_Expect();
    nrf_mesh_net_master_secmat_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    friend_update_enqueue_Expect();

    frnd_event_hndlr(&evt);

    const packet_mesh_trs_packet_t friend_update_pdu = {.pdu = {
            0x02,                    /* Friend Update opcode */
            0x01,                    /* Flag key refresh in Phase 2 */
            0x00, 0x00, 0x12, 0x34,  /* IV index */
            0x00,                    /* MD queue is empty */
        }};

    transport_packet_metadata_t trs_metadata = {
        .segmented = false,
        .receivers = TRANSPORT_PACKET_RECEIVER_FRIEND,
        .mic_size = 4,
        .type.control = {
            .opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE
        },
        .segmentation = {0},
        .net = {
            .control_packet = true,
            .src = 0x00AA,
            .dst = {
                .value = m_lpn_src,
                .type = NRF_MESH_ADDRESS_TYPE_UNICAST
            },
            .ttl = 3,
        },
        .p_security_material = NULL,
        .token = 0xDEAD1337,
        .tx_bearer_selector = CORE_TX_BEARER_TYPE_FRIEND
    };

    friend_relay_Expect(&friend_update_pdu, 7, &trs_metadata);
    friend_poll_Receive(1);

    evt.params.key_refresh.phase = NRF_MESH_KEY_REFRESH_PHASE_3;
    nrf_mesh_net_secmat_from_index_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    friendship_secmat_get_Expect();
    nrf_mesh_net_master_secmat_get_ExpectAnyArgsAndReturn(&m_friend_secmat);
    frnd_event_hndlr(&evt);
    friend_update_Expect(NRF_MESH_KEY_REFRESH_PHASE_3);
    friend_poll_Receive(0);
}
